tests/suite-root-url-test/9000-conc-300/ab_report.txt
This is ApacheBench, Version 2.3 <$Revision: 1528965 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.0.0.14 (be patient)


Server Software:        WEBrick/1.3.1
Server Hostname:        10.0.0.14
Server Port:            80

Document Path:          /
Document Length:        547 bytes

Concurrency Level:      300
Time taken for tests:   55.395 seconds
Complete requests:      9000
Failed requests:        0
Keep-Alive requests:    9000
Total transferred:      7947000 bytes
HTML transferred:       4923000 bytes
Requests per second:    162.47 [#/sec] (mean)
Time per request:       1846.498 [ms] (mean)
Time per request:       6.155 [ms] (mean, across all concurrent requests)
Transfer rate:          140.10 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.1      0       9
Processing:   136 1820 1261.1   1761    9814
Waiting:      136 1820 1261.1   1761    9814
Total:        142 1821 1260.9   1762    9814

Percentage of the requests served within a certain time (ms)
  50%   1762
  66%   2490
  75%   2745
  80%   2975
  90%   3292
  95%   3748
  98%   4258
  99%   5522
 100%   9814 (longest request)